ghosoft/stc-mcu-open-source/header-generator/stc8af.h
// SFR CL: PCA base timer low
SFR(CL, 0xE9);

// SFR CCAP0L: PCA module 0 capture register low
SFR(CCAP0L, 0xEA);

// SFR CCAP1L: PCA module 1 capture register low
SFR(CCAP1L, 0xEB);

// SFR CCAP2L: PCA module 2 capture register low
SFR(CCAP2L, 0xEC);

// SFR CCAP3L: PCA module 3 capture register low
SFR(CCAP3L, 0xED);

// SFR AUXINTIF: Extended external interrupt flag register
SFR(AUXINTIF, 0xEF);
#define T2IF 0x1
#define T3IF 0x2
#define T4IF 0x4
#define INT2IF 0x10
#define INT3IF 0x20
#define INT4IF 0x40

// SFR B: B register
SFR(B, 0xF0);

// SFR PWMCFG: PWM configuration register
SFR(PWMCFG, 0xF1);
#define ETADC 0x40
#define CBIF 0x80

// SFR PCA_PWM0: PCA PWM mode auxiliary register 0
SFR(PCA_PWM0, 0xF2);
#define EPC0L 0x1
#define EPC0H 0x2
#define XCCAP0L0 0x4
#define XCCAP0L1 0x8
#define XCCAP0H0 0x10
#define XCCAP0H1 0x20
#define EBS00 0x40
#define EBS01 0x80

// SFR PCA_PWM1: PCA PWM mode auxiliary register 1
SFR(PCA_PWM1, 0xF3);
#define EPC1L 0x1
#define EPC1H 0x2
#define XCCAP1L0 0x4
#define XCCAP1L1 0x8
#define XCCAP1H0 0x10
#define XCCAP1H1 0x20
#define EBS10 0x40
#define EBS11 0x80

// SFR PCA_PWM2: PCA PWM mode auxiliary register 2
SFR(PCA_PWM2, 0xF4);
#define EPC2L 0x1
#define EPC2H 0x2
#define XCCAP2L0 0x4
#define XCCAP2L1 0x8
#define XCCAP2H0 0x10
#define XCCAP2H1 0x20
#define EBS20 0x40
#define EBS21 0x80

// SFR PCA_PWM3: PCA PWM mode auxiliary register 3
SFR(PCA_PWM3, 0xF5);
#define EPC3L 0x1
#define EPC3H 0x2
#define XCCAP3L0 0x4
#define XCCAP3L1 0x8
#define XCCAP3H0 0x10
#define XCCAP3H1 0x20
#define EBS30 0x40
#define EBS31 0x80

// SFR PWMIF: PWM interrupt flag
SFR(PWMIF, 0xF6);
#define C0IF 0x1
#define C1IF 0x2
#define C2IF 0x4
#define C3IF 0x8
#define C4IF 0x10
#define C5IF 0x20
#define C6IF 0x40
#define C7IF 0x80

// SFR PWMFDCR: PWM exception detection control register
SFR(PWMFDCR, 0xF7);
#define FDIF 0x1
#define FDIO 0x2
#define FDCMP 0x4
#define EFDI 0x8
#define FLTFLIO 0x10
#define ENFD 0x20
#define INVIO 0x40
#define INVCMP 0x80

// SFR P7: Port 7
SFR(P7, 0xF8);

// SFR CH: PCA base timer high
SFR(CH, 0xF9);

// SFR CCAP0H: PCA module 0 capture register high
SFR(CCAP0H, 0xFA);

// SFR CCAP1H: PCA module 1 capture register high
SFR(CCAP1H, 0xFB);

// SFR CCAP2H: PCA module 2 capture register high
SFR(CCAP2H, 0xFC);

// SFR CCAP3H: PCA module 3 capture register high
SFR(CCAP3H, 0xFD);

// SFR PWMCR: PWM control register
SFR(PWMCR, 0xFE);
#define ECBI 0x40
#define ENPWM 0x80

// SFR RSTCFG: Reset configuration register
SFR(RSTCFG, 0xFF);
#define LVDS0 0x1
#define LVDS1 0x2
#define P54RST 0x10
#define ENLVR 0x40

// SFR CKSEL: Clock selection register
SFRX(CKSEL, 0xFE00);
#define MCKSEL0 0x1
#define MCKSEL1 0x2
#define MCLKO_S 0x8
#define MCLKODIV0 0x10
#define MCLKODIV1 0x20
#define MCLKODIV2 0x40
#define MCLKODIV3 0x80

// SFR CLKDIV: Clock frequency division register
SFRX(CLKDIV, 0xFE01);

// SFR IRC24MCR: Internal 24MHz RC oscillator control register
SFRX(IRC24MCR, 0xFE02);
#define IRC24MST 0x1
#define ENIRC24M 0x80

// SFR XOSCCR: External oscillator control register
SFRX(XOSCCR, 0xFE03);
#define XOSCST 0x1
#define XITYPE 0x40
#define ENXOSC 0x80

// SFR IRC32KCR: Internal 32kHz oscillator control register
SFRX(IRC32KCR, 0xFE04);
#define IRC32KST 0x1
#define ENIRC32K 0x80

// SFR P0PU: Port 0 pull-up resistor control register
SFRX(P0PU, 0xFE10);

// SFR P1PU: Port 1 pull-up resistor control register
SFRX(P1PU, 0xFE11);

// SFR P2PU: Port 2 pull-up resistor control register
SFRX(P2PU, 0xFE12);

// SFR P3PU: Port 3 pull-up resistor control register
SFRX(P3PU, 0xFE13);

// SFR P4PU: Port 4 pull-up resistor control register
SFRX(P4PU, 0xFE14);

// SFR P5PU: Port 5 pull-up resistor control register
SFRX(P5PU, 0xFE15);

// SFR P6PU: Port 6 pull-up resistor control register
SFRX(P6PU, 0xFE16);

// SFR P7PU: Port 7 pull-up resistor control register
SFRX(P7PU, 0xFE17);

// SFR P0NCS: Port 0 Schmidt trigger control register
SFRX(P0NCS, 0xFE18);

// SFR P1NCS: Port 1 Schmidt trigger control register
SFRX(P1NCS, 0xFE19);

// SFR P2NCS: Port 2 Schmidt trigger control register
SFRX(P2NCS, 0xFE1A);

// SFR P3NCS: Port 3 Schmidt trigger control register
SFRX(P3NCS, 0xFE1B);

// SFR P4NCS: Port 4 Schmidt trigger control register
SFRX(P4NCS, 0xFE1C);

// SFR P5NCS: Port 5 Schmidt trigger control register
SFRX(P5NCS, 0xFE1D);

// SFR P6NCS: Port 6 Schmidt trigger control register
SFRX(P6NCS, 0xFE1E);

// SFR P7NCS: Port 7 Schmidt trigger control register
SFRX(P7NCS, 0xFE1F);

// SFR I2CCFG: I2C configuration register
SFRX(I2CCFG, 0xFE80);
#define MSSPEED0 0x1
#define MSSPEED1 0x2
#define MSSPEED2 0x4
#define MSSPEED3 0x8
#define MSSPEED4 0x10
#define MSSPEED5 0x20
#define MSSL 0x40
#define ENI2C 0x80

// SFR I2CMSCR: I2C host control register
SFRX(I2CMSCR, 0xFE81);
#define MSCMD0 0x1
#define MSCMD1 0x2
#define MSCMD2 0x4
#define MSCMD3 0x8
#define EMSI 0x80

// SFR I2CMSST: I2C host state register
SFRX(I2CMSST, 0xFE82);
#define MSACK0 0x1
#define MSACK1 0x2
#define MSIF 0x40
#define MSBUSY 0x80

// SFR I2CSLCR: I2C slave control register
SFRX(I2CSLCR, 0xFE83);
#define SLRST 0x1
#define ESTOI 0x8
#define ETXI 0x10
#define ERXI 0x20
#define ESTAI 0x40

// SFR I2CSLST: I2C slave state register
SFRX(I2CSLST, 0xFE84);
#define SLACK0 0x1
#define SLACK1 0x2
#define TXING 0x4
#define STOIF 0x8
#define TXIF 0x10
#define RXIF 0x20
#define STAIF 0x40
#define SLBUSY 0x80

// SFR I2CSLADR: I2C slave address register
SFRX(I2CSLADR, 0xFE85);
#define MA 0x1
#define SLADR0 0x2
#define SLADR1 0x4
#define SLADR2 0x8
#define SLADR3 0x10
#define SLADR4 0x20
#define SLADR5 0x40
#define SLADR6 0x80

// SFR I2CTXD: I2C data transmission register
SFRX(I2CTXD, 0xFE86);

// SFR I2CRXD: I2C data receiving register
SFRX(I2CRXD, 0xFE87);

// SFR I2CMSAUX: I2C host auxiliary control register
SFRX(I2CMSAUX, 0xFE88);
#define WDTA 0x1

// SFR PWM0T1H: PWM0 Timer 1 high
SFRX(PWM0T1H, 0xFF00);

// SFR PWM0T1L: PWM0 Timer 1 low
SFRX(PWM0T1L, 0xFF01);

// SFR PWM0T2H: PWM0 Timer 2 high
SFRX(PWM0T2H, 0xFF02);

