ghosoft/stc-mcu-open-source/header-generator/stc8af.h
// SFR PWM0T2L: PWM0 Timer 2 low
SFRX(PWM0T2L, 0xFF03);

// SFR PWM0CR: PWM0 control register
SFRX(PWM0CR, 0xFF04);
#define EC0T1SI 0x1
#define EC0T2SI 0x2
#define EC0I 0x4
#define C0_S0 0x8
#define C0_S1 0x10
#define C0INI 0x40
#define ENC0O 0x80

// SFR PWM0HLD: PWM0 level hold control register
SFRX(PWM0HLD, 0xFF05);
#define HC0L 0x1
#define HC0H 0x2

// SFR PWM1T1H: PWM1 Timer 1 high
SFRX(PWM1T1H, 0xFF10);

// SFR PWM1T1L: PWM1 Timer 1 low
SFRX(PWM1T1L, 0xFF11);

// SFR PWM1T2H: PWM1 Timer 2 high
SFRX(PWM1T2H, 0xFF12);

// SFR PWM1T2L: PWM1 Timer 2 low
SFRX(PWM1T2L, 0xFF13);

// SFR PWM1CR: PWM1 control register
SFRX(PWM1CR, 0xFF14);
#define EC1T1SI 0x1
#define EC1T2SI 0x2
#define EC1I 0x4
#define C1_S0 0x8
#define C1_S1 0x10
#define C1INI 0x40
#define ENC1O 0x80

// SFR PWM1HLD: PWM1 level hold control register
SFRX(PWM1HLD, 0xFF15);
#define HC1L 0x1
#define HC1H 0x2

// SFR PWM2T1H: PWM2 Timer 1 high
SFRX(PWM2T1H, 0xFF20);

// SFR PWM2T1L: PWM2 Timer 1 low
SFRX(PWM2T1L, 0xFF21);

// SFR PWM2T2H: PWM2 Timer 2 high
SFRX(PWM2T2H, 0xFF22);

// SFR PWM2T2L: PWM2 Timer 2 low
SFRX(PWM2T2L, 0xFF23);

// SFR PWM2CR: PWM2 control register
SFRX(PWM2CR, 0xFF24);
#define EC2T1SI 0x1
#define EC2T2SI 0x2
#define EC2I 0x4
#define C2_S0 0x8
#define C2_S1 0x10
#define C2INI 0x40
#define ENC2O 0x80

// SFR PWM2HLD: PWM2 level hold control register
SFRX(PWM2HLD, 0xFF25);
#define HC2L 0x1
#define HC2H 0x2

// SFR PWM3T1H: PWM3 Timer 1 high
SFRX(PWM3T1H, 0xFF30);

// SFR PWM3T1L: PWM3 Timer 1 low
SFRX(PWM3T1L, 0xFF31);

// SFR PWM3T2H: PWM3 Timer 2 high
SFRX(PWM3T2H, 0xFF32);

// SFR PWM3T2L: PWM3 Timer 2 low
SFRX(PWM3T2L, 0xFF33);

// SFR PWM3CR: PWM3 control register
SFRX(PWM3CR, 0xFF34);
#define EC3T1SI 0x1
#define EC3T2SI 0x2
#define EC3I 0x4
#define C3_S0 0x8
#define C3_S1 0x10
#define C3INI 0x40
#define ENC3O 0x80

// SFR PWM3HLD: PWM3 level hold control register
SFRX(PWM3HLD, 0xFF35);
#define HC3L 0x1
#define HC3H 0x2

// SFR PWM4T1H: PWM4 Timer 1 high
SFRX(PWM4T1H, 0xFF40);

// SFR PWM4T1L: PWM4 Timer 1 low
SFRX(PWM4T1L, 0xFF41);

// SFR PWM4T2H: PWM4 Timer 2 high
SFRX(PWM4T2H, 0xFF42);

// SFR PWM4T2L: PWM4 Timer 2 low
SFRX(PWM4T2L, 0xFF43);

// SFR PWM4CR: PWM4 control register
SFRX(PWM4CR, 0xFF44);
#define EC4T1SI 0x1
#define EC4T2SI 0x2
#define EC4I 0x4
#define C4_S0 0x8
#define C4_S1 0x10
#define C4INI 0x40
#define ENC4O 0x80

// SFR PWM4HLD: PWM4 level hold control register
SFRX(PWM4HLD, 0xFF45);
#define HC4L 0x1
#define HC4H 0x2

// SFR PWM5T1H: PWM5 Timer 1 high
SFRX(PWM5T1H, 0xFF50);

// SFR PWM5T1L: PWM5 Timer 1 low
SFRX(PWM5T1L, 0xFF51);

// SFR PWM5T2H: PWM5 Timer 2 high
SFRX(PWM5T2H, 0xFF52);

// SFR PWM5T2L: PWM5 Timer 2 low
SFRX(PWM5T2L, 0xFF53);

// SFR PWM5CR: PWM5 control register
SFRX(PWM5CR, 0xFF54);
#define EC5T1SI 0x1
#define EC5T2SI 0x2
#define EC5I 0x4
#define C5_S0 0x8
#define C5_S1 0x10
#define C5INI 0x40
#define ENC5O 0x80

// SFR PWM5HLD: PWM5 level hold control register
SFRX(PWM5HLD, 0xFF55);
#define HC5L 0x1
#define HC5H 0x2

// SFR PWM6T1H: PWM6 Timer 1 high
SFRX(PWM6T1H, 0xFF60);

// SFR PWM6T1L: PWM6 Timer 1 low
SFRX(PWM6T1L, 0xFF61);

// SFR PWM6T2H: PWM6 Timer 2 high
SFRX(PWM6T2H, 0xFF62);

// SFR PWM6T2L: PWM6 Timer 2 low
SFRX(PWM6T2L, 0xFF63);

// SFR PWM6CR: PWM6 control register
SFRX(PWM6CR, 0xFF64);
#define EC6T1SI 0x1
#define EC6T2SI 0x2
#define EC6I 0x4
#define C6_S0 0x8
#define C6_S1 0x10
#define C6INI 0x40
#define ENC6O 0x80

// SFR PWM6HLD: PWM6 level hold control register
SFRX(PWM6HLD, 0xFF65);
#define HC6L 0x1
#define HC6H 0x2

// SFR PWM7T1H: PWM7 Timer 1 high
SFRX(PWM7T1H, 0xFF70);

// SFR PWM7T1L: PWM7 Timer 1 low
SFRX(PWM7T1L, 0xFF71);

// SFR PWM7T2H: PWM7 Timer 2 high
SFRX(PWM7T2H, 0xFF72);

// SFR PWM7T2L: PWM7 Timer 2 low
SFRX(PWM7T2L, 0xFF73);

// SFR PWM7CR: PWM7 control register
SFRX(PWM7CR, 0xFF74);
#define EC7T1SI 0x1
#define EC7T2SI 0x2
#define EC7I 0x4
#define C7_S0 0x8
#define C7_S1 0x10
#define C7INI 0x40
#define ENC7O 0x80

// SFR PWM7HLD: PWM7 level hold control register
SFRX(PWM7HLD, 0xFF75);
#define HC7L 0x1
#define HC7H 0x2

// SFR PWMCH: PWM counter high
SFRX(PWMCH, 0xFFF0);

// SFR PWMCL: PWM counter low
SFRX(PWMCL, 0xFFF1);

// SFR PWMCKS: PWM clock selection register
SFRX(PWMCKS, 0xFFF2);
#define PWM_PS0 0x1
#define PWM_PS1 0x2
#define PWM_PS2 0x4
#define PWM_PS3 0x8
#define SELT2 0x10

// SFR TADCPH: ADC counter value high
SFRX(TADCPH, 0xFFF3);

// SFR TADCPL: ADC counter value low
SFRX(TADCPL, 0xFFF4);
// External interrupt 0
#define EXTINT0_INTERRUPT 0
#define EXTINT0_VECTOR_ADDR 0x03
// Timer 0 interrupt
#define TIMER0_INTERRUPT 1
#define TIMER0_VECTOR_ADDR 0x0B
// External interrupt 1
#define EXTINT1_INTERRUPT 2
#define EXTINT1_VECTOR_ADDR 0x13
// Timer 1 interrupt
#define TIMER1_INTERRUPT 3
#define TIMER1_VECTOR_ADDR 0x1B
// UART 1 interrupt
#define UART1_INTERRUPT 4
#define UART1_VECTOR_ADDR 0x23
// ADC interrupt
#define ADC_INTERRUPT 5
#define ADC_VECTOR_ADDR 0x2B
// Low-voltage detector interrupt
#define LVD_INTERRUPT 6
#define LVD_VECTOR_ADDR 0x33
// PCA interrupt
#define PCA_INTERRUPT 7
#define PCA_VECTOR_ADDR 0x3B
// UART 2 interrupt
#define UART2_INTERRUPT 8
#define UART2_VECTOR_ADDR 0x43
// SPI interrupt
#define SPI_INTERRUPT 9
#define SPI_VECTOR_ADDR 0x4B
// External interrupt 2 (falling edge only)
#define EXTINT2_INTERRUPT 10
#define EXTINT2_VECTOR_ADDR 0x53
// External interrupt 3 (falling edge only)
#define EXTINT3_INTERRUPT 11
#define EXTINT3_VECTOR_ADDR 0x5B
// Timer 2 interrupt
#define TIMER2_INTERRUPT 12
#define TIMER2_VECTOR_ADDR 0x63
// External interrupt 4 (falling edge only)
#define EXTINT4_INTERRUPT 16
#define EXTINT4_VECTOR_ADDR 0x83
// UART 3 interrupt
#define UART3_INTERRUPT 17
#define UART3_VECTOR_ADDR 0x8B
// UART 4 interrupt
#define UART4_INTERRUPT 18
#define UART4_VECTOR_ADDR 0x93
// Timer 3 interrupt
#define TIMER3_INTERRUPT 19
#define TIMER3_VECTOR_ADDR 0x9B
// Timer 4 interrupt
#define TIMER4_INTERRUPT 20
#define TIMER4_VECTOR_ADDR 0xA3
// Comparator interrupt
#define CMP_INTERRUPT 21
#define CMP_VECTOR_ADDR 0xAB
// Enhanced PWM interrupt
#define PWM_INTERRUPT 22
#define PWM_VECTOR_ADDR 0xB3
// Enhanced PWM fault detection interrupt
#define PWMFD_INTERRUPT 23
#define PWMFD_VECTOR_ADDR 0xBB
// I2C interrupt
#define I2C_INTERRUPT 24
#define I2C_VECTOR_ADDR 0xC3

// Default value for macro F_CPU
#ifndef F_CPU
#define F_CPU 24000000UL
#endif

// Default value for macro T_CPU
#ifndef T_CPU
#define T_CPU 1
#endif

inline void enableExtendedSFR() { P_SW2 |= EAXSFR; }
inline void disableExtendedSFR() { P_SW2 &= ~EAXSFR; }

#endif // _STC8AF_H
